{
	"name":"renzroy",
	"briefHistory": "The University of Caloocan City is indeed a community-driven tertiary educational institution having started as as community college on July 1, 1971, when the Minister of Education, Onofre D. Corpus, authorized the first-year operation of the proposed Caloocan City Community College. Aimed to implement the national development goal of the government that promoted the maximum participation of all people in the attainment and enjoyment of the benefits of growth and provided quality educational opportunities to its indigent but deserving constituents, Municipal Ordinance No. 1495 appropriated the amount of P23,400.00 therefore.The next two years of UCC's operations became even more fruitful following the approval by the Minister of Education of the second year of general education course and one-year secretarial course on June 22,1972, with P35,100 city budget (Mun. Ord. No. 2020), and the third year opening of Bachelor of Science in Industrial Education and Bachelor of Science in Business Technology with P36,760 city budget (Mun. Ord. No. 2140).On March 25, 1975 Ordinance No. 2295 provided for the charter of the renamed Caloocan City Polytechnic College defining its purpose as follows: '(a) To develop the Filipino intellect and explore its manpower potentials; (b) To help promote a continuing welfare as well as improving the standard of living of the people of Caloocan City, and providing them with meaningful education that is geard towards the demands of an emerging industrial society, and (c) To help enhance the prestige of the underprivileged by providing them with low-tuition fee education, the fundamental instrument toward the improvement of their economic status.'A fire that guttet the High School PTA Building in 1984 forced the College to move to the nearby elementary school before transferring to the Sangandaan site. In June 1996, the old buildings in Buena Park and Camarin were converted into classrooms and became two separate campuses, while Tandang Sora Annex at 7th avenue started classes in November, 2002, to accommodate the upsurge of students entering the university.From an enrollment of 42 in 1971 the College had 3600 in 2000. In June 1996, it offered two (2) graduate courses: Master in Public Administration (MPA) and Master of Arts in Education (MAEd). To make the college more responsive to the needs of the City's constituents, government employees with 60 undergraduate units were enrolled as third year students in the special Bachelor in Public Administration in 1997.In the first LET in August 1996, a BEED graduate placed 4th in the national ranking and in 1998 a 24-unit student placed 10th. From then on, the yearly passing percentage of the UCC examineed has always been above the national mean.",
					"On Februrary 9, 2004, after 33 long years, City Ordinance No. 0375 converted the Caloocan City Polytechnic College into a full-fledged University known as the University of Caloocan City (UCC)."
					"The rest in history."
}